const questions = [
  {
    title: 'Назовите дату начала Сталинградской битвы.',
    variants: ['17 июля 1942 года', '16 июля 1942 года', '18 июля 1942 года', '17 июня 1942 года'],
    correct: 0,
  },
  {
    title: 'Сколько дней длилась Сталинградская битва?',
    variants: ['190', '200', '210', '220'],
    correct: 1,
  },
  {
    title: 'За какой срок Гитлер хотел овладеть городом?',
    variants: ['За 3 недели', 'За 2 недели', 'За 1 неделю', 'За 3 дня'],
    correct: 1,
  },
  {
    title: 'Танковый завод в Сталинграде не прекращал работу даже в самые тяжелые дни. Какие танки отправлялись сразу с конвейера в бой?',
    variants: [
      'ИС-2',
      'КВ-1',
      'Т-34',
      'КВ-2',
    ],
    correct: 2,
  },
  {
    title: 'Как называлась Сталинградская военная операция советских войск?',
    variants: [
      'Уран',
      'Тайфун',
      'Барбаросса',
      'Искра',
    ],
    correct: 0,
  },
  {
    title: 'Когда был подписан знаменитый приказ №227, известный, как “Ни шагу назад!”?',
    variants: [
      '19 января 1943г.',
      '1 февраля 1943г.',
      '26 июля 1942г.',
      '28 июля 1942г.',
    ],
    correct: 3,
  },
  {
    title: 'Где находится то место, которое защитники Сталинграда называют главной высотой России?',
    variants: [
      'Мамаев курган',
      'Пик Пушкина',
      'Коштантау',
      'Мижирги',
    ],
    correct: 0,
  },
  {
    title: 'Чем награжден город за эту битву?',
    variants: [
      'Орденом Ленина и Золотой звездой Героя',
      'Орденом Ленина',
      'Золотой звездой Героя',
      'Не был награжден',
    ],
    correct: 0,
  },
  {
    title: 'Как называлась заключительная операция Сталинградской битвы?',
    variants: [
      '«Фортуна»',
      '«Колибри»',
      '«Пелина»',
      '«Кольцо»',
    ],
    correct: 3,
  },
  {
    title: 'Когда закончилась Сталинградская битва?',
    variants: [
      '19 января 1943г.',
      '1 февраля 1943г.',
      '2 февраля 1943 года.',
      '28 июля 1943г.',
    ],
    correct: 2,
  },
];

export default questions;
